Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportGetBoltedPartsHoleElevations(System.Int32,System.Collections.Generic.Dictionary{System.Int32,System.Tuple{System.Double,System.Double}}@)
DO NOT USE! For internal usage only.
boltId: The bolt identifier.
holeElevations: The hole elevations.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportGetShapeMetadata(Tekla.Structures.ModelInternal.dotClientId_t@,System.String)
DO NOT USE! For internal usage only.
ClientId: Client ID to identify the communication partners.
guid: GUID of the shape whose metadata we are getting///
Returns: Returns 1 if successful, 0 otherwise.

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportGetShapeMetadata(Tekla.Structures.ModelInternal.dotClientId_t@,System.String)
DO NOT USE! For internal usage only.
clientId: Calling client ID.
guid: The GUID of the shape.///
Returns: 1 if getting the metadata was successful, 0 otherwise